In [11]:
import numpy as np
import pandas as pd

In [9]:
s = pd.Series(list('abca'))
print(s)

0    a
1    b
2    c
3    a
dtype: object

In [13]:
pd.get_dummies(s)

       a      b      c
0   True  False  False
1  False   True  False
2  False  False   True
3   True  False  False

In [3]:
data = {'col_1': [3, 2, 1, 0], 'col_2': ['a', 'b', 'c', 'd']}
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [7]:
df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
                           'two'],
                   'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'baz': [1, 2, 3, 4, 5, 6],
                   'zoo': ['x', 'y', 'z', 'q', 'w', 't']})

# df.pivot(index='foo',columns='bar',values='baz')
df.pivot(index='foo',columns='bar')['baz']

bar  A  B  C
foo
one  1  2  3
two  4  5  6

In [ ]:
data = {'row_1': [3, 2, 1, 0], 'row_2': ['a', 'b', 'c', 'd']}
pd.DataFrame.from_dict(data, orient="index")

       0  1  2  3
row_1  3  2  1  0
row_2  a  b  c  d

In [8]:
pd.DataFrame.from_dict(data,orient="index",columns=['一','二','三','四'])

       一  二  三  四
row_1  3  2  1  0
row_2  a  b  c  d

In [10]:
df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
df.axes
df

   col1  col2
0     1     3
1     2     4

In [11]:
df = pd.DataFrame({'species': ['bear', 'bear', 'marsupial'],
                  'population': [1864, 22000, 80000]},
                  index=['panda', 'polar', 'koala'])
df

         species  population
panda       bear        1864
polar       bear       22000
koala  marsupial       80000

In [12]:
df = pd.DataFrame({'species':['bear','bear','marsupial'],
                   'population':[1864,22000,80000]},
                   index=['panda','polar','koala'])
df

         species  population
panda       bear        1864
polar       bear       22000
koala  marsupial       80000

In [13]:
df = pd.DataFrame({'num_legs':[2, 4], 'num_wings':[2, 0]},
                  index=['falcon','dog'])
df

        num_legs  num_wings
falcon         2          2
dog            4          0